import '../models/dua_model.dart';

final List<Dua> duasList = [
  Dua(
    title: "دعاء التلبية",
    arabicText: "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ",
    translation: "لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك",
    source: "متفق عليه",
    category: "حج",
  ),
  Dua(
    title: "دعاء دخول الحرم",
    arabicText: "اللَّهُمَّ هَذَا حَرَمُكَ وَأَمْنُكَ فَاجْعَلْنِي مُحَرَّمًا عَلَى النَّارِ وَآمِنْ مِنْ عَذَابِكَ",
    translation: "اللهم هذا حرمك وأمنك فاجعلني محرماً على النار وآمن من عذابك",
    source: "ابن السني",
    category: "عمرة",
  ),
  Dua(
    title: "دعاء الطواف",
    arabicText: "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    translation: "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
    source: "البقرة: 201",
    category: "عمومي",
  ),
];
